#include <iostream>

using namespace std;

int main()
{
    char Name;
    
    cout<<"*в довіднику наявні такі річки, як Дніпро, Сян, Вісла і Любка*\n";
    cout<<"Введіть першу літеру назви річки просимо писати з маленької англійської букви:  ";
    cin>>Name;
    
    switch (Name){
        case 1: cout<<"Довжина річки дорівнює 2201км, і вона налічує 12 приток"; break;
        case 2: cout<<"Довжина річки дорівнює 443км, і вона налічує 10 приток"; break;
        case 3: cout<<"Довжина річки дорівнює 1047км, і вона налічує 6 головних приток"; break;
        case 4: cout<<"Довжина річки дорівнює 9км, і в неї вісутні притоки"; break;
        default: {
            cout<<"нажаль, річки на таку літеру не знайдено. Спробуйте ще раз"; break;
        }
    }

    return 0;
}
